### Terraform Plan: `project`

#### Result: `success`

<details><summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_artifact_registry_repository.music_graph must be replaced
-/+ resource "google_artifact_registry_repository" "music_graph" {
      - cleanup_policy_dry_run = false -> null
      ~ create_time            = "2025-12-09T13:35:10.527145Z" -> (known after apply)
      ~ effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      ~ id                     = "projects/music-graph-479719/locations/us/repositories/gcr.io" -> (known after apply)
      - labels                 = {} -> null
      ~ location               = "us" -> "us-east1" # forces replacement
      ~ name                   = "gcr.io" -> (known after apply)
      ~ terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      ~ update_time            = "2025-12-20T13:44:03.832911Z" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ vulnerability_scanning_config (known after apply)
      - vulnerability_scanning_config {
          - enablement_state        = "SCANNING_DISABLED" -> null
          - enablement_state_reason = "API containerscanning.googleapis.com is not enabled." -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
stdout<<ghadelimiter_cf02210e-bc6b-4753-aaf3-de433825a458

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_artifact_registry_repository.music_graph must be replaced
-/+ resource "google_artifact_registry_repository" "music_graph" {
      - cleanup_policy_dry_run = false -> null
      ~ create_time            = "2025-12-09T13:35:10.527145Z" -> (known after apply)
      ~ effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      ~ id                     = "projects/music-graph-479719/locations/us/repositories/gcr.io" -> (known after apply)
      - labels                 = {} -> null
      ~ location               = "us" -> "us-east1" # forces replacement
      ~ name                   = "gcr.io" -> (known after apply)
      ~ terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      ~ update_time            = "2025-12-20T13:44:03.832911Z" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ vulnerability_scanning_config (known after apply)
      - vulnerability_scanning_config {
          - enablement_state        = "SCANNING_DISABLED" -> null
          - enablement_state_reason = "API containerscanning.googleapis.com is not enabled." -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

ghadelimiter_cf02210e-bc6b-4753-aaf3-de433825a458
stderr<<ghadelimiter_8ff2d6c6-9baa-47dc-ba36-c76e0a7b24f0

ghadelimiter_8ff2d6c6-9baa-47dc-ba36-c76e0a7b24f0
exitcode<<ghadelimiter_f6ef45c9-0dcd-4abf-9e17-53a5a8849ccd
0
ghadelimiter_f6ef45c9-0dcd-4abf-9e17-53a5a8849ccd
```

</details>

*Pushed by: @billgrant, Action: `pull_request`*